nxp-mcuxpresso/mcux-soc-svd/MCXN546T/MCXN546T_cm33_core1.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>EVTG0</name>
      <description>EVTG</description>
      <groupName>EVTG</groupName>
      <baseAddress>0x400D2000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>EVTG_INST[%s]</name>
          <description>Array of registers: EVTG_AOI0_BFT01, EVTG_AOI0_BFT23, EVTG_AOI0_FILT, EVTG_AOI1_BFT01, EVTG_AOI1_BFT23, EVTG_AOI1_FILT, EVTG_CTRL</description>
          <addressOffset>0</addressOffset>
          <register>
            <name>EVTG_AOI0_BFT01</name>
            <description>AOI0 Boolean Function Term 0 and 1 Configuration</description>
            <addressOffset>0</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>PT1_DC</name>
                <description>Product Term 1, D Input Configuration</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PT1_DC0</name>
                    <description>Force the D input in this product term to a logical zero</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT1_DC1</name>
                    <description>Pass the D input in this product term</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT1_DC2</name>
                    <description>Complement the D input in this product term</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT1_DC3</name>
                    <description>Force the D input in this product term to a logical one</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PT1_CC</name>
                <description>Product Term 1, C Input Configuration</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CC_0</name>
                    <description>Force the C input in this product term to a logical zero</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC_1</name>
                    <description>Pass the C input in this product term</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC_2</name>
                    <description>Complement the C input in this product term</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC_3</name>
                    <description>Force the C input in this product term to a logical one</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PT1_BC</name>
                <description>Product Term 1, B Input Configuration</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BC_0</name>
                    <description>Force the B input in this product term to a logical zero</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BC_1</name>
                    <description>Pass the B input in this product term</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BC_2</name>
                    <description>Complement the B input in this product term</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BC_3</name>
                    <description>Force the B input in this product term to a logical one</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PT1_AC</name>
                <description>Product Term 1, A Input Configuration</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AC_0</name>
                    <description>Force the A input in this product term to a logical zero</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AC_1</name>
                    <description>Pass the A input in this product term</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AC_2</name>
                    <description>Complement the A input in this product term</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AC_3</name>
                    <description>Force the A input in this product term to a logical one</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PT0_DC</name>
                <description>Product Term 0, D Input Configuration</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DC_0</name>
                    <description>Force the D input in this product term to a logical zero</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DC_1</name>
                    <description>Pass the D input in this product term</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DC_2</name>
                    <description>Complement the D input in this product term</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DC_3</name>
                    <description>Force the D input in this product term to a logical one</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PT0_CC</name>
                <description>Product Term 0, C Input Configuration</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CC0_0</name>
                    <description>Force the C input in this product term to a logical zero</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC0_1</name>
                    <description>Pass the C input in this product term</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC0_2</name>
                    <description>Complement the C input in this product term</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC0_3</name>
                    <description>Force the C input in this product term to a logical one</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PT0_BC</name>
                <description>Product Term 0, B Input Configuration</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PT0_BC0</name>
                    <description>Force the B input in this product term to a logical zero</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT0_BC1</name>
                    <description>Pass the B input in this product term</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT0_BC2</name>
                    <description>Complement the B input in this product term</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT0_BC3</name>
                    <description>Force the B input in this product term to a logical one</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PT0_AC</name>
                <description>Product Term 0, A Input Configuration</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PT0_AC0</name>
                    <description>Force the A input in this product term to a logical zero</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT0_AC1</name>
                    <description>Pass the A input in this product term</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT0_AC2</name>
                    <description>Complement the A input in this product term</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT0_AC3</name>
                    <description>Force the A input in this product term to a logical one</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>EVTG_AOI0_BFT23</name>
            <description>AOI0 Boolean Function Term 2 and 3 Configuration</description>
            <addressOffset>0x2</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>PT3_DC</name>
                <description>Product Term 3, D Input Configuration</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PT3_DC0</name>
                    <description>Force the D input in this product term to a logical zero</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT3_DC1</name>
                    <description>Pass the D input in this product term</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT3_DC2</name>
                    <description>Complement the D input in this product term</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT3_DC3</name>
                    <description>Force the D input in this product term to a logical one</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PT3_CC</name>
                <description>Product Term 3, C Input Configuration</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PT3_CC0</name>
                    <description>Force the C input in this product term to a logical zero</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT3_CC1</name>
                    <description>Pass the C input in this product term</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT3_CC2</name>
                    <description>Complement the C input in this product term</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT3_CC3</name>
                    <description>Force the C input in this product term to a logical one</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PT3_BC</name>
                <description>Product Term 3, B Input Configuration</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PT3_BC0</name>
                    <description>Force the B input in this product term to a logical zero</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT3_BC1</name>
                    <description>Pass the B input in this product term</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT3_BC2</name>
                    <description>Complement the B input in this product term</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT3_BC3</name>
                    <description>Force the B input in this product term to a logical one</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PT3_AC</name>
                <description>Product Term 3, A Input Configuration</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PT3_AC0</name>
                    <description>Force the A input in this product term to a logical zero</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT3_AC1</name>
                    <description>Pass the A input in this product term</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT3_AC2</name>
                    <description>Complement the A input in this product term</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT3_AC3</name>
                    <description>Force the A input in this product term to a logical one</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PT2_DC</name>
                <description>Product Term 2, D Input Configuration</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PT2_DC0</name>
                    <description>Force the D input in this product term to a logical zero</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT2_DC1</name>
                    <description>Pass the D input in this product term</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT2_DC2</name>
                    <description>Complement the D input in this product term</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT2_DC3</name>
                    <description>Force the D input in this product term to a logical one</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PT2_CC</name>
                <description>Product Term 2, C Input Configuration</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PT2_CC0</name>
                    <description>Force the C input in this product term to a logical zero</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT2_CC1</name>
                    <description>Pass the C input in this product term</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT2_CC2</name>
                    <description>Complement the C input in this product term</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT2_CC3</name>
                    <description>Force the C input in this product term to a logical one</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PT2_BC</name>
                <description>Product Term 2, B Input Configuration</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PT2_BC0</name>
                    <description>Force the B input in this product term to a logical zero</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT2_BC1</name>
                    <description>Pass the B input in this product term</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT2_BC2</name>
                    <description>Complement the B input in this product term</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT2_BC3</name>
                    <description>Force the B input in this product term to a logical one</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PT2_AC</name>
                <description>Product Term 2, A Input Configuration</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PT2_AC0</name>
                    <description>Force the A input in this product term to a logical zero</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT2_AC1</name>
                    <description>Pass the A input in this product term</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT2_AC2</name>
                    <description>Complement the A input in this product term</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PT2_AC3</name>
                    <description>Force the A input in this product term to a logical one</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
